Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/spec/blog/index.po
Languages: uk

source: Blog Site
uk: Сайт Блогу

source: The project aims to develop a robust and user-friendly web application using the Django framework. The primary objective is to create a blogging platform that allows users to publish and manage articles on various topics. The application will provide an intuitive interface for authors to compose and format their articles, while also offering a seamless reading experience for visitors.
uk: Проект має на меті розробку міцного та зручного у використанні веб-додатка за допомогою фреймворку Django. Основна мета полягає у створенні платформи для блогів, яка дозволить користувачам публікувати та керувати статтями на різні теми. Додаток надасть інтуїтивний інтерфейс авторам для створення та форматування своїх статей, а також забезпечить безперешкодний досвід читання для відвідувачів.

source: **Key Features**
uk: **Основні функції**

source: User Registration and Authentication
uk: Реєстрація та Аутентифікація Користувачів

source: The application will provide user registration and authentication functionality, allowing individuals to create accounts, log in, and manage their profile information. This feature will enable authors to have personalized accounts and maintain ownership of their published articles.
uk: Застосунок надасть функціональність реєстрації та аутентифікації користувачів, дозволяючи індивідуумам створювати облікові записи, входити в систему та керувати інформацією свого профілю. Ця функція дозволить авторам мати персоналізовані облікові записи та зберігати право власності на їхні опубліковані статті.

source: Article Management
uk: Керування Статтями

source: Authors will have the ability to create, edit, and delete articles within the application. The system will offer a user-friendly editor. Additionally, authors will be able to categorize articles by assigning relevant topics to them.
uk: Автори матимуть можливість створювати, редагувати та видаляти статті в рамках додатка. Система надасть зручний редактор. Крім того, автори зможуть категоризувати статті, присвоюючи їм відповідні теми.

source: Topic Subscription:
uk: Підписка на Теми:

source: The application will include a subscription feature that allows users to subscribe to topics of interest. By subscribing to specific topics, users will receive notifications or updates whenever new articles are published in those categories. This feature will enhance user engagement and ensure that readers stay informed about the topics they find most valuable.
uk: Автори матимуть можливість створювати, редагувати та видаляти статті в рамках додатка. Система надасть зручний редактор. Крім того, автори зможуть категоризувати статті, присвоюючи їм відповідні теми.

source: Overall, the project aims to deliver an efficient blogging platform that caters to both authors and readers. By providing a seamless user experience and incorporating essential functionalities such as user authentication, article management, and topic subscriptions, the application will empower users to create, share, and explore engaging content within a well-structured and organized platform.
uk: Застосунок буде містити функцію підписки, яка дозволить користувачам підписуватися на цікаві їм теми. Підписавшись на конкретні теми, користувачі отримуватимуть повідомлення або оновлення кожного разу, коли в цих категоріях будуть публікуватися нові статті. Ця функція покращить залученість користувачів та забезпечить, що читачі будуть інформовані про найцікавіші для них теми.

source: Here is a starter repository template, that may helps: `Starter template`_.
uk: Ось шаблон стартового репозиторію, який може допомогти: `Starter template`_.

source: Challenge: Functional views
uk: Виклик: Функціональні представлення

source: It's ok not to return **actual** content for now. Just ensure all the routes are available and provide correct data. Use anything you like to return within HTTP response.
uk: Зараз немає потреби повертати **фактичний** вміст. Просто переконайтеся, що всі маршрути доступні та надають правильні дані. Використовуйте будь-що, що ви хочете повернути в HTTP-відповіді.

source: ``/about/``: Provides a regular text for a user, describing the functionalities of the django site.
uk: ``/about/``: надає звичайний текст для користувача, що описує функції сайту django.

source: ``/``: A site's homepage. This will contain a list of blogs published via the django site.
uk: ``/``: Головна сторінка сайту. Тут буде перелік блогів, опублікованих через сайт Django.

source: ``/<article>/``: A single article detail view. The URL contains dynamic part in it. This will be used to fetch a single article from the database.
uk: ``/<article>/``: Представлення деталей однієї статті. URL містить динамічну частину. Вона буде використовуватися для отримання однієї статті з бази даних.

source: ``/<article>/comment/``: This view will be used to add comments to a article.
uk: ``/<article>/comment/``: Це представлення буде використовуватися для додавання коментарів до статті.

source: ``/create/``: A article creation form.
uk: ``/create/``: Форма створення статті.

source: ``/<article>/update/``: A view to update an existing article data.
uk: ``/<article>/update/``: Представлення для оновлення існуючих даних статті.

source: ``/<article>/delete/``: A view to confirm article deletion.
uk: ``/<article>/delete/``: Представлення для підтвердження видалення статті.

source: ``/topics/``: A list of topics available on the site.
uk: ``/topics/``: Перелік доступних тем на сайті.

source: ``/topics/<topic>/add/``: Add the selected topic to preferred topics list.
uk: ``/topics/<topic>/add/``: Додати обрану тему до списку обраних тем.

source: ``/topics/<topic>/remove/``: Removes the selected topic from preferred.
uk: ``/topics/<topic>/remove/``: Видаляє вибрану тему з обраних.

source: ``/topics/<topic>/subscribe/``: A view to subscribe for a topic.
uk: ``/topics/<topic>/subscribe/``: Представлення для підписки на тему.

source: ``/topics/<topic>/unsubscribe/``: A view to unsubscribe from a topic.
uk: ``/topics/<topic>/unsubscribe/``: Представлення для відписки від теми.

source: ``/profile/<str:username>/``: A site user's personal page.
uk: ``/profile/<str:username>/``: Особиста сторінка користувача сайту.

source: ``/set-password/``: This route will be used to change users' credential data.
uk: ``/set-password/``: Цей маршрут буде використовуватися для зміни облікових даних користувачів.

source: ``/set-userdata/``: This route will be user to change users' data.
uk: ``/set-userdata/``: Цей маршрут буде використовуватися для зміни даних користувачів.

source: ``/deactivate/``: Account deactivation (deletion) view.
uk: ``/deactivate/``: Представлення для деактивації облікового запису (видалення).

source: ``/register/``: This view contains a user registration form.
uk: ``/register/``: Сторінка з формою для реєстрації нового користувача.

source: ``/login/``: This view contains a login form.
uk: ``/login/``: Сторінка з формою для логіна.

source: ``/logout/``: Logout page. This view should redirect user back to homepage.
uk: ``/logout/``: Логаут. Має перенаправляти користувача назад на домашню сторінку..

source: Optional task(s)
uk: Додаткові завдання

source: ``/archive/<int:year>/<int:month>/``: This view provides a list of articles published on a specified month of a specified year. This view should apply date validation and raise ``Http404`` for invalid paths. The valid date is a year's 4-digits form followed by 1 or 2 digits representing month. Month range should be limited as [1..12], leading zero may be omitted. Valid URLs are:
uk: ``/archive/<int:year>/<int:month>/``: Це представлення надає список статей, опублікованих у певному місяці певного року. Це представлення повинно застосовувати перевірку дати та викидати помилку ``Http404`` для неприпустимих шляхів. Припустимою датою є 4-значний формат року, за яким слідує 1 або 2 цифри, що представляють місяць. Діапазон місяця повинен бути обмежений [1..12], ведучий нуль може бути пропущений. Приклади правильних URL-адрес:

source: Challenge: Data models
uk: Завдання: моделі даних

source: Django admin may be used to create some dummy data. To gather access to admin section you need to create a superuser. The easiest way to do that is to use a django command:
uk: Для створення деяких фіктивних даних можна використовувати Django Admin. Щоб отримати доступ до адміністративного розділу, вам потрібно створити суперкористувача. Найпростіший спосіб зробити це - використовувати команду Django:

source: General
uk: Основне

source: Each model will be registered for admin site.
uk: Кожна модель буде зареєстрована на сторінці адміністрації сайту.

source: Article topic
uk: Тема статті

source: This is a simple model, that contains information about topic:
uk: Ось проста модель, що містить інформацію про тему:

source: topic title (unique value, 64 characters or fewer)
uk: назва теми (унікальне значення, не більше 64 символів)

source: topic short description (255 characters or fewer)
uk: короткий опис теми (не більше 255 символів)

source: Article
uk: Стаття

source: Article requires title (255 characters or fewer).
uk: Стаття вимагає наявності заголовка (не більше 255 символів).

source: Article requires content (at least 255 characters).
uk: Стаття вимагає наявності змісту (принаймні 255 символів).

source: Creation date should be autogenerated at article creation, and would never be updated.
uk: Дата створення буде автоматично генеруватися при створенні статті і не буде оновлюватися пізніше.

source: Updated date will be update at each article save.
uk: Дата оновлення буде оновлюватися при кожному збереженні статті.

source: Article comment
uk: Коментар до статті

source: Comment requires creation date (autogenerated).
uk: Коментар вимагає наявності дати створення (автоматично генерується).

source: Comment requires message text.
uk: Коментар вимагає наявності тексту повідомлення.

source: Relationships
uk: Відносини

source: Standard Django user model **will be** used for now. To apply model reference pass ``"auth.User"`` as related model. Users can be created via admin page. You can also refer the same model as shown below:
uk: Стандартна модель користувача Django **буде** використовуватися наразі. Для застосування посилання на модель передайте ``"auth.User"`` як пов'язану модель. Користувачі можуть бути створені через адміністративну сторінку. Ви також можете посилатися на ту саму модель, як показано нижче:

source: ``article`` and ``topics`` have *many-to-many* relationship.
uk: ``article`` та ``topics`` мають *багато-до-багатьох* відношення.

source: ``article`` and ``user`` have *one-to-many* relationship. A article can have **only one** author, but users can create as many articles as they want.
uk: ``article`` та ``user`` мають *один-до-багатьох* відношення. У статті може бути **лише один** автор, але користувачі можуть створювати стільки статей, скільки їм потрібно.

source: ``article`` and ``comment`` have *one-to-many* relationship. A article may be a container for many comments, but a comment is related to a single article.
uk: ``article`` та ``comment`` мають *один-до-багатьох* відношення. Стаття може бути контейнером для багатьох коментарів, але коментар пов'язаний лише з однією статтею.

source: ``comment`` and ``user`` have *one-to-many* relationship. It's similar to *article - user* relationship.
uk: ``comment`` та ``user`` мають *один-до-багатьох* відношення. Це схоже на відношення *стаття - користувач*.

source: ``topic`` and ``user`` use *many-to-many* relationship. A single user can prefer none or as many topics as needed and vice versa. This relationship represents topics preferred by a certain blog user. Also this provides an additional option to mark some of preferred topics with a **notify** flag, to receive newsletters about specified topics updates. The difference between *prefer* and *notify* is that *preferred* topics affect the articles list for a user, and *notify* is responsible for newsletters for the user.
uk: ``topic`` та ``user`` використовують відношення *багато-до-багатьох*. Один користувач може вибрати будь-яку кількість тем, і навпаки. Це відношення представляє теми, які вибрані певним користувачем блогу. Крім того, це надає додаткову опцію позначити деякі з вибраних тем прапорцем **notify**, щоб отримувати розсилки про оновлення зазначених тем. Відмінність між *prefer* (вибір) та *notify* (сповіщення) полягає в тому, що *prefer* впливає на список статей для користувача, а *notify* відповідає за розсилку новин для користувача.

source: UML diagram
uk: UML діаграми

source: Challenge: ORM
uk: Завдання: ORM

source: Update existing views to represent entities that are actually stored inside the project's database.
uk: Оновіть існуючі подання, щоб представити сутності, які фактично зберігаються в базі даних проекту.

source: ``/``: should represent a list of existing articles.
uk: ``/``: повинен представляти список існуючих статей.

source: ``/<article>/``: should represent a single existing article.
uk: ``/<article>/``: повинен представляти окрему існуючу статтю.

source: Detail view should obtain a list of article related comments.
uk: Вью для перегляду окремої статті повинен отримувати зв'язані коментарі.

source: ``/profile/<str:username>/``: should contain information about user and a list of articles authored by this user.
uk: ``/profile/<str:username>/``: повинен містити інформацію про користувача та список статей, написаних цим користувачем.

source: All views related to a single entity (*detail*, *update*, *delete*, *profile*) should raise ``Http404`` in case entity could not be fetched.
uk: Усі ресурси, пов'язані з окремою сутністю (*деталі*, *оновлення*, *видалення*, *профіль*) мають викликати ``Http404`` у випадку, якщо сутність не вдалося отримати.

source: It's common to store dedicated functions/classes that supports some specific business logic in a separate module called ``services.py`` or ``utils.py`` within an application directory.
uk: Звичайно, функції/класи, що підтримують певну специфічну бізнес-логіку, розумно зберігати в окремому модулі з назвою ``services.py`` або ``utils.py`` всередині директорії додатку.

source: Create a service to fetch articles, ordered by a specified user preferences. This means, topics preferred by a user affects articles orders. Queryset should be ordered in way, to have articles with most corresponding topics at the begging.
uk: Створіть сервіс для того, щоб отримувати статі у вигляді відсортованому згідно вподобань зазначеного користувача. Це означає, що чим більше тем зазначених у статті співпадає з вподобаннями користувача, тим ближче вона до початку видачі.

source: Challenge: Templates
uk: Завдання: Шаблони

source: Helpful link: `Bootstrap template`_
uk: Корисне посилання: `Bootstrap template`_

source: Links related to user data **may be** placeholders for now.
uk: Посилання, що стосуються даних користувача, **можуть бути** плейсхолдерами наразі.

source: **All** templates should be inherited from the ``base.html`` template.
uk: **Усі** шаблони повинні успадковувати ``base.html`` шаблон.

source: Each page has a descriptive title HTML tag, which included ``| Blog`` suffix, e.g. "Articles | Blogs", "Sample | Blog", "Login | Blog" etc.
uk: Кожна сторінка має описовий тег HTML заголовка, включаючи суфікс ``| Blog``, наприклад, "Articles | Blogs", "Sample | Blog", "Login | Blog" і т.д.

source: Each page should contain a link to homepage (``/`` URL route).
uk: Кожна сторінка повинна містити посилання на головну сторінку (шлях URL ``/``).

source: Each page contains a list of registered topics. Each view of this kind filters only articles of a relevant topic. This should be implemented with a custom template context processor.
uk: Кожна сторінка містить список зареєстрованих тем. Кожне представлення цього типу фільтрує лише статті відповідної теми. Це слід реалізувати за допомогою власного обробника контексту шаблону (template context processor).

source: Replace content block for *about* page with some static content.
uk: Замініть блок вмісту (content block) для сторінки *about* на деякий статичний вміст.

source: Application-level templates should be located within appropriate applications.
uk: Шаблони рівня застосунків розташовуватися у відповідних застосунках.

source: Each page should contain a list of links to archive views for the last year.
uk: Кожна сторінка має містити список посилань на перегляди архіву за останній рік.

source: Each page should contain an inclusion-block(s) with following links:
uk: Кожна сторінка повинна містити блок(и) включення з такими посиланнями:

source: ``/registration/``: new user registration form
uk: ``/register/``: форма реєстрації нового користувача

source: ``/login/``: user login form
uk: ``/login/``: форма логіна користувача

source: ``/create/``: article creation page
uk: ``/create/``: форма створення статті

source: Articles list
uk: Список статей

source: Main page contains a list of published articles.
uk: Головна сторінка містить список опублікованих статей.

source: Each article entity is rendered using a custom template tag.
uk: Кожен елемент статті відображається за допомогою власного шаблонного тегу.

source: ``article`` template tag renders information about a article object:
uk: Шаблонний тег ``article`` відображає інформацію про об'єкт статті:

source: article title
uk: заголовок статті

source: article content (trimmed to ~50 characters)
uk: зміст статті (обрізаний до ~50 символів)

source: article creation date
uk: дата створення статті

source: related topics (3 topics or fewer)
uk: пов'язані теми (3 або менше)

source: number of related comments
uk: кількість коментарів до статті

source: Article details
uk: Деталі статті

source: Article update and deletion views **would not** affect data for now.
uk: Оновлення та видалення статей **не будуть** впливати на дані наразі.

source: A article detail page contains links to **update** or **delete** current article.
uk: На сторінці деталей статті мають бути посилання на **оновлення** або **видалення** поточної статті.

source: Page provides information about article:
uk: Сторінка надає інформацію про статтю:

source: Article title
uk: Заголовок статті

source: Creation date
uk: Дата створення

source: Author name
uk: Ім'я автора

source: Related topics
uk: Пов'язані теми

source: Article content
uk: Вміст статті

source: Page contains a list of related comments.
uk: Сторінка містить список пов'язаних коментарів.

source: Each comment contains:
uk: Кожен коментар містить:

source: Comment creation time
uk: Час створення коментаря

source: Comment message
uk: Текст комментаря

source: Profile page
uk: Строніка профілю

source: Author page contains information about author:
uk: Сторінка автора містить інформацію про автора:

source: First name
uk: Ім'я

source: Last name
uk: Прізвище

source: Add more information, if needed.
uk: Додайте більше інформації за бажанням.

source: Author page contains a list of articles created by this author.
uk: Сторінка автора містить список статей, створених цим автором.

source: Author page contains buttons/links to change user data and password or deactivate a user's account.
uk: Сторінка автора містить кнопки/посилання для зміни користувача та пароля або деактивації облікового запису користувача.

source: Forms
uk: Форми

source: There is **no need** to add actual forms now. They will be generated by Django. This section describes the final view of these pages. It's ok just to create a dedicated templates for future use.
uk: Наразі **немає потреби** додавати фактичні форми. Вони будуть створені Django. Цей розділ описує кінцевий вигляд цих сторінок. Для майбутнього використання достатньо створити окремі шаблони.

source: ``/register/`` page contains a new user registration form. It should take inputs from the user:
uk: Сторінка ``/register/`` містить форму реєстрації нового користувача. Вона повинна отримувати введені дані від користувача:

source: ``/login/`` page contains a user login form. It should take the inputs from the user:
uk: Сторінка ``/login/`` містить форму входу користувача. Вона повинна отримувати введені дані від користувача:

source: ``/create/`` and ``/<article>/update/`` pages contain a form to collect a article's data:
uk: Сторінки ``/create/`` та ``/<article>/update/`` містять форму для збору даних статті:

source: relevant topics
uk: відповідні теми

source: ``/<article>/delete`` page contains a simple delete confirmation form.
uk: Сторінка ``/<article>/delete`` містить просту форму для підтвердження видалення.

source: Change password form has two fields:
uk: Форма зміни пароля має два поля:

source: Change user's data form collects all information, that can be changed, e.g. ``username``, ``first name``, ``last name`` etc.
uk: Форма зміни даних користувача збирає всю інформацію, яка може бути змінена, наприклад, ``username``, ``first name``, ``last name`` та інше.

source: User preferences page contains a list of available topics. User can mark some topics as preferred. Also for preferred topics an option to *subscribe* for the newsletters becomes available.
uk: Сторінка налаштувань користувача містить список доступних тем. Користувач може відмітити деякі теми як пріоритетні (переваги). Також для пріоритетних тем стає доступною опція *підписки* на розсилку новинних листів.

source: Challenge: Articles' slugs
uk: Виклик: Slug-и статей

source: This is an optional challenge in addition to:
uk: Це додатковий виклик у додаток до:

source: Update ``Article`` model with ``slug`` field. The slug value is:
uk: Оновіть модель ``Article``, додавши поле ``slug``. Значення slug поля є:

source: required for each article
uk: обов'язкове для кожної статті

source: unique for each article
uk: унікальне для кожної статті

source: Create a data migration to provide slugs for existing articles.
uk: Створіть міграцію даних для надання slug-ів існуючим статтям.

source: ``slug`` should be auto-generated on article save. The pattern is ``article.title-article.created_date``, e.g. "Sample article" created at "03/24/2023" should receive slug: ``sample-article-2023-03-24``.
uk: Поле ``slug`` повинно автоматично генеруватися при збереженні статті. Шаблон для генерації поля ``slug``: ``назва-статті-дата-створення-статті``, наприклад, стаття з назвою "Sample article", створена "24/03/2023", отримає slug: ``sample-article-2023-03-24``.

source: Update detail view URL path with article slug as dynamic portion.
uk: Оновіть шлях URL для представлення деталей статті з динамічною частиною, якою буде slug статті.

source: Challenge: Auth forms
uk: Завдання: форми авторизації

source: Create form for new users registration with required fields:
uk: Створити форму для реєстрації нових користувачів із обов'язковими полями:

source: ``username`` value should be validated against existing values.
uk: Значення ``username`` повинно перевірятися на відповідність існуючим значенням.

source: ``password`` and ``confirm password`` values should match.
uk: Значення ``password`` і ``confirm password`` мають збігатися.

source: Create form for existing users login.
uk: Створити форму для входу існуючих користувачів.

source: Validations errors are to be rendered on the template.
uk: Помилки перевірки повинні відображатися на шаблоні.

source: Challenge: Authentication
uk: Завдання: Автентифікація

source: For anonymous users ``/register/`` and ``/login/`` links should be visible in navbar.
uk: Для анонімних користувачів посилання ``/register/`` і ``/login/`` мають бути видимими на панелі навігації.

source: For authenticated users ``/logout/`` and ``/create/`` links should be visible in navbar.
uk: Для автентифікованих користувачів посилання ``/logout/`` і ``/create/`` мають бути видимими на панелі навігації.
