Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/spec/blog/index.po
Languages: uk

source: If authenticated user is admin or stuff they should see a link to admin page.
uk: Якщо автентифікований користувач є адміністратором або іншим, він має побачити посилання на сторінку адміністратора.

source: ``/register/``: Users should provide all required information about them: desired username and email. Name data (both first and last) is optional. After user creation they should be redirected to login page to perform authentication process. Invalid form should provide information about error(s).
uk: ``/register/``: користувачі повинні надати всю необхідну інформацію про себе: бажане ім'я користувача та електронну адресу. Дані імені (ім'я та прізвище) необов'язкові. Після створення користувача вони повинні бути перенаправлені на сторінку входу для виконання процесу автентифікації. Недійсна форма повинна надавати інформацію про помилку(и).

source: ``/login/``: Users should provide their credentials to login. In case login is successful they should be redirected to their profile (if no ``?next=url`` query string available).
uk: ``/login/``: користувачі повинні надати свої облікові дані для входу. У разі успішного входу вони повинні бути перенаправлені до свого профілю (якщо немає рядка запиту ``?next=url``).

source: ``/create/``: Only authenticated users should be able to visit this page. In case anonymous user is trying to request this view they should be redirected to the login view first, and after successful authentication get back to article creation. Then a article is created, it should be authored by the currently authenticated user.
uk: ``/create/``: Лише аутентифіковані користувачі повинні мати доступ до цієї сторінки. Якщо анонімний користувач намагається отримати доступ до цього представлення, його повинно перенаправити спочатку на сторінку входу, а після успішної аутентифікації повернути на сторінку створення статті. При створенні статті вона повинна мати автором поточного аутентифікованого користувача.

source: ``/<article>/comment/``: Currently authenticated user should be referenced as a comment's author.
uk: ``/<article>/comment/``: У коментарі поточного аутентифікованого користувача повинна бути зазначена його ідентифікація як автора.

source: Articles may be modified or deleted only by their authors from the detail article page. However, admins can still performs articles actions from the admin page.
uk: Змінювати або видаляти статті можуть тільки їх автори на сторінці деталей статті. Однак адміністратори все ще можуть виконувати дії зі статтями через адміністративну сторінку.

source: User related paths are restricted for non-authorized users.
uk: Шляхи, пов'язані з користувачем, обмежені для неаутентифікованих користувачів.

source: ``POST`` request ``/deactivate/`` should mark current authenticated user as *deleted* and log them user.
uk: Запит ``POST`` на ``/deactivate/`` повинен позначати поточного аутентифікованого користувача як *видаленого* і виходити з системи для цього користувача.

source: Authenticated users should be able to adjust their preferred topics lists.
uk: Авторизовані користувачі повинні мати можливість налаштовувати свої списки обраних тем.

source: Authenticated users should be able to **subscribe** or **unsubscribe** for a selected topic.
uk: Авторизовані користувачі повинні мати можливість **підписатися** або **відписатися** на обрану тему.

source: Adjust the order of article list according to authenticated user preferences. For anonymous users keep default ordering.
uk: Призначте зміну порядку списку статей відповідно до вподобань аутентифікованого користувача. Для анонімних користувачів залиште типове сортування за замовчуванням.

source: Implement account reactivation behavior. The exact workflow does not mater. The sample scenario is to collect email for the user and check it for existing in the database. After that create a request for admin to activate an account and send a confirmation email, when all is done.
uk: Реалізуйте поведінку щодо відновлення облікового запису. Точний порядок дій не має значення. Один зі зразків сценаріїв може полягати у зборі електронної пошти користувача та перевірки наявності цієї адреси в базі даних. Після цього створіть запит для адміністратора на активацію облікового запису та надішліть підтверджувальний лист електронною поштою, коли все буде готово.

source: Challenge: Article related forms
uk: Виклик: Форми пов'язані зі статтями

source: Implement a article form. This form will be used to create new articles and to update existing ones.
uk: Реалізуйте форму статті. Ця форма буде використовуватися для створення нових статей та оновлення існуючих.

source: Each created article should have at least one related topic.
uk: Кожна створена стаття повинна мати принаймні одну пов'язану тему.

source: Implement a comment form to gather a comment from a user.
uk: Реалізуйте форму коментаря, щоб збирати коментарі від користувача.

source: Only ``POST`` requests to ``/<article>/comment/`` are allowed from this moment.
uk: З даного моменту дозволені лише запити типу ``POST`` до ``/<article>/comment/``.

source: Implement functionality:
uk: Реалізуйте функціональність:

source: article creation
uk: створення статті

source: article update
uk: оновлення статті

source: article comment (create a related comment)
uk: коментування статті (створення коментаря)

source: article deletion
uk: видалення статті

source: Only authenticated users can create articles.
uk: Лише аутентифіковані користувачі можуть створювати статі.

source: Article can be edited only by its author.
uk: Стаття може редагуватись лише її автором.

source: Article can be deleted only by its author.
uk: Стаття може видалятись лише її автором.

source: Only authenticated users can comment articles.
uk: Лише аутентифіковані користувачі можуть коментувати статті.

source: Challenge: Class-Based Views
uk: Завдання: Class-Based Views

source: Replace **all** existing views via ``CBV``.
uk: Замінити **всі** існуючі перегляди через ``CBV``.

source: Existing functionality should not be corrupted.
uk: Існуюча функціональність не повинна бути пошкоджена.

source: It's ok to use built-in Django CBV if needed.
uk: Якщо потрібно, можна використовувати вбудовані класи відображення у Django (CBV).

source: Challenge: Serializers
uk: Завдання: Серіалізатори

source: Topic serializer is for read-only purposes only. Topics can be created via admin page only.
uk: Серіалізатор для теми призначений лише для операцій читання (read-only). Теми можна створювати лише через адміністративну сторінку.

source: Serialized data should contain all available data, e.g. ``pk``, ``title``, ``description``.
uk: Серіалізовані дані повинні містити всю доступну інформацію, наприклад, ``pk``, ``title``, ``description``.

source: article comment serializer can perform both reading and writing operations. But it can't be used to *update* or *delete* comment.
uk: серіалізатор коментаря статті може виконувати як операції читання, так і операції запису. Проте він не може використовуватися для оновлення або видалення коментаря.

source: Random, or pre-defined user may be used as comment's author for now. This will be fixed in the future.
uk: Наразі можна використовувати випадкового або попередньо визначеного користувача як автора коментаря. Це буде виправлено у майбутньому.

source: article serializer provides full access to articles. All operations are available: list, retrieve, create, update and destroy.
uk: серіалізатор статей надає повний доступ до статей. Доступні всі операції: отримання списку, отримання окремої статті, створення нової статті, оновлення та видалення.

source: User
uk: Користувач

source: User serializer provides full access to site users data. All operations are available for now: list, retrieve, create, update and destroy. This behavior will be fixed in the future, to prevent unauthorized data modifications.
uk: Серіалізатор користувача надає повний доступ до даних користувачів сайту. Усі операції доступні наразі: отримання списку користувачів, отримання окремого користувача, створення нового користувача, оновлення та видалення. Однак, ця поведінка буде виправлена у майбутньому для запобігання несанкціонованим змінам даних.

source: Challenge: API views
uk: Завдання: API views

source: All blog-site functionality are to be mirrored via REST API.
uk: Вся функціональність сайту повинна бути відображена за допомогою REST API.

source: It's ok to pass *pre-defined* user as argument in request's body. This will be fixed in the next challenge.
uk: Наразі дозволяється передавати *наперед визначеного* користувача у тілі запиту. Це буде виправлено у наступному розділі.

source: Challenge: Authentication and Permissions
uk: Завдання: Автентифікація та Дозволи

source: Implement authentication system for REST API.
uk: Реалізуйте систему аутентифікації для REST API.

source: For non-authenticated users it is possible to create a new account
uk: Для неаутентифікованих користувачів можлива створення нового облікового запису

source: For non-authenticated users it is possible to obtain authentication data.
uk: Для неаутентифікованих користувачів можлива отримання даних аутентифікації.

source: Access to user data is restricted. Authorized users can manipulate only their own data (e.g. ``retrieve``, ``update``).
uk: Доступ до даних користувача обмежений. Авторизовані користувачі можуть маніпулювати лише своїми власними даними (наприклад, ``retrieve``, ``update``).

source: Admins can retrieve all users data (``list``), but can't change them via REST API. However, it is still possible via admin page.
uk: Адміністратори можуть отримати дані всіх користувачів (``list``), але не можуть змінювати їх через REST API. Однак це все ще можливо через адміністративну сторінку.

source: Authorized users can ``create`` articles or ``update`` and ``delete`` articles created by them.
uk: Авторизовані користувачі можуть ``create`` статті або ``update`` та ``delete`` статті, створені ними.

source: Authorized users can add comments to a specified article.
uk: Авторизовані користувачі можуть додавати коментарі до вказаної статті.

source: Authorized users can adjust their topics preferences.
uk: Авторизовані користувачі можуть налаштовувати свої уподобання щодо тем.
