Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/rdbms/query.po
Languages: uk

source: This is called ``INNER JOIN``, which means that the result table will contain only whose rows from left-hard and right-hand tables, that have corresponding records to each other.
uk: Це називається ``INNER JOIN``, що означає, що результуюча таблиця буде містити тільки ті рядки з лівої та правої таблиць, які мають відповідні записи один одному.

source: The same result may be obtained using ``JOIN`` clause. All ``JOIN`` options are just a notation convenience, since they do nothing you couldn't do with plain ``FROM`` and ``WHERE``.
uk: Той самий результат можна отримати за допомогою оператора ``JOIN``. Всі опції ``JOIN`` є лише зручністю для нотації, оскільки вони не роблять нічого такого, чого не можна було б зробити за допомогою звичайних ``FROM`` і ``WHERE``.

source: ``INNER JOIN`` is the default while joining two tables with each other.
uk: ``INNER JOIN`` використовується за замовчуванням при з'єднанні двох таблиць одна з одною.

source: Right and left joins
uk: Праве та ліве з'єднання

source: ``LEFT OUTER JOIN`` returns all rows in the qualified Cartesian product (i.e., all combined rows that pass its condition), plus one copy of each row in the left-hand table for which there was no right-hand row that passed the join condition.
uk: ``LEFT OUTER JOIN`` повертає всі рядки кваліфікованого декартового добутку (тобто всі об'єднані рядки, які задовольняють його умову), плюс по одній копії кожного рядка лівої таблиці, для якого не було рядка правої таблиці, що задовольняє умову об'єднання.

source: Conversely, ``RIGHT OUTER JOIN`` returns all the joined rows, plus one row for each unmatched right-hand row. This is just a notation convenience, since you could convert it to a ``LEFT OUTER JOIN`` by switching the left and right tables.
uk: І навпаки, ``RIGHT OUTER JOIN`` повертає всі об'єднані рядки, плюс один рядок для кожного невідповідного правого рядка. Це просто зручність позначення, оскільки ви можете перетворити його на ``LEFT OUTER JOIN``, помінявши місцями ліву та праву таблиці.
