Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/rdbms/query.po
Languages: uk

source: Query data from database
uk: Запит даних з бази даних

source: Querying data
uk: Запит даних

source: The process of retrieving or the command to retrieve data from a database is called a *query*. In SQL the ``SELECT`` command is used to specify queries.
uk: Процес отримання або команда для отримання даних з бази даних називається *запит*. У мові SQL для визначення запитів використовується команда ``SELECT``.

source: ``SELECT`` retrieves rows from zero or more tables. The general processing of ``SELECT`` is as follows:
uk: ``SELECT`` вибирає рядки з нуля або більше таблиць. Загальна обробка ``SELECT`` відбувається наступним чином:

source: All queries in the ``WITH`` list are computed. This effectively serve as temporary tables that can be referenced in the ``FROM`` list.
uk: Всі запити у списку ``WITH`` обчислюються. Це фактично слугує тимчасовими таблицями, на які можна посилатися у списку ``FROM``.

source: All elements in the ``FROM`` list are computed. If more than one element is specified in the ``FROM`` list, they are cross-joined together.
uk: Обчислюються всі елементи списку ``FROM``. Якщо у списку ``FROM`` вказано більше одного елемента, вони об'єднуються разом.

source: If ``WHERE`` clause is specified, all rows that do not satisfy the condition are eliminated from the output.
uk: Якщо вказано оператор ``WHERE``, то всі рядки, які не задовольняють умові, вилучаються з виводу.

source: If the ``GROUP BY`` clause is specified, or if there are aggregate function calls, the output is combined into groups of rows that match on one or more values, and the result of aggregate functions are computed. If the ``HAVING`` clause is present, it eliminates groups that does not satisfy the given condition.
uk: Якщо вказано речення ``GROUP BY`` або якщо є виклики агрегатних функцій, то вихідні дані об'єднуються в групи рядків, які збігаються за одним або декількома значеннями, і обчислюються результати агрегатних функцій. Якщо присутній оператор ``HAVING``, то вилучаються групи, які не задовольняють заданій умові.

source: The actual output rows are computed using the ``SELECT`` output expressions for each row or row of group.
uk: Фактичні вихідні рядки обчислюються за допомогою виразів ``SELECT`` для кожного рядка або рядка групи.

source: ``SELECT DISTINCT`` eliminates duplicate rows from the result. ``SELECT DISTINCT ON`` eliminates rows that match on all the specified expressions.
uk: ``SELECT DISTINCT`` видаляє повторювані рядки з результату. ``SELECT DISTINCT ON`` вилучає рядки, які збігаються за всіма вказаними виразами.

source: Using the operators ``UNION``, ``INTERSECT``, and ``EXCEPT``, the output of more than one ``SELECT`` statement can be combined to form a single result set.
uk: За допомогою операторів ``UNION``, ``INTERSECT`` і ``EXCEPT`` можна об'єднати результати виконання кількох інструкцій ``SELECT``, щоб сформувати єдиний набір результатів.

source: The ``UNION`` operator returns **all** rows that are in one or both result sets.
uk: Оператор ``UNION`` повертає **всі** рядки, які є в одному або обох наборах результатів.

source: The ``INTERSECT`` operator returns all rows that are strictly in both result sets.
uk: Оператор ``INTERSECT`` повертає всі рядки, які строго знаходяться в обох наборах результатів.

source: The ``EXCEPT`` operator returns the rows that are in the first result set, but not in the second.
uk: Оператор ``EXCEPT`` повертає рядки, які є в першому наборі результатів, але відсутні в другому.

source: If the ``ORDER BY`` clause is specified, the returned rows are sorted in the specific order.
uk: Якщо вказано параметр ``ORDER BY``, повернуті рядки буде відсортовано у певному порядку.

source: if the ``LIMIT`` or ``OFFSET`` clause is specified, the ``SELECT`` statement only returns a subset of the result rows.
uk: якщо вказано оператор ``LIMIT`` або ``OFFSET``, то інструкція ``SELECT`` повертає лише підмножину рядків результату.

source: If ``FOR UPDATE``, ``FOR NO KEY UPDATE``, ``FOR SHARE`` or ``FOR KEY SHARE`` is specified, the ``SELECT`` statement locks the selected rows against concurrent updates.
uk: Якщо вказано ``FOR UPDATE``, ``FOR NO KEY UPDATE``, ``FOR SHARE`` або ``FOR KEY SHARE``, оператор ``SELECT`` блокує вибрані рядки від одночасного оновлення.

source: Select rows from a table
uk: Виберіть рядки з таблиці

source: A simple kind of query has the form:
uk: Простий вид запиту має вигляд:

source: This command would retrieve all rows and all user-defined columns from ``publisher`` table. A select list can also select a subset of the available columns or make calculations using the columns.
uk: Ця команда вилучить усі рядки і всі визначені користувачем стовпці з таблиці ``publisher``. Список вибору може також вибирати підмножину доступних стовпців або виконувати обчислення за цими стовпцями.

source: ``FROM`` clause is a simple kind of table expression: it reads just one table. In general, table expression can be complex constructs of base tables, joins and sub-queries. But it is possible to omit the table expression entirely and use the ``SELECT`` command as a calculator (or in some another way):
uk: речення ``FROM`` є простим різновидом табличного виразу: воно зчитує лише одну таблицю. Взагалі, табличний вираз може бути складною конструкцією з базових таблиць, з'єднань і підзапитів. Але можна взагалі не використовувати табличний вираз і використовувати команду ``SELECT`` як калькулятор (або в інший спосіб):

source: The ``FROM`` clause derives a table from one or more other tables given in a comma-separated table reference list. A table reference can a table name, or derived table such as sub-query, a ``JOIN`` construct, or complex combinations of these. If more than one table reference is listed in the ``FROM`` clause, the table are cross-joined. The result of the ``FROM`` list is an intermediate virtual table tant can then be subject to transformations by the ``WHERE``, ``GROUP BY``, and ``HAVING`` clauses and is finally the result of the overall table expression.
uk: Речення ``FROM`` виводить таблицю з однієї або кількох інших таблиць, наведених у списку посилань на таблиці, розділених комами. Посилання на таблицю може бути ім'ям таблиці або похідною таблицею, наприклад, підзапитом, конструкцією ``JOIN`` або їх складними комбінаціями. Якщо в реченні ``FROM`` вказано більше одного посилання на таблицю, то таблиці з'єднуються перехресним зв'язком. Результатом списку ``FROM`` є проміжна віртуальна таблиця, яка потім може бути піддана перетворенням за допомогою речень ``WHERE``, ``GROUP BY`` і ``HAVING`` і, нарешті, є результатом загального табличного виразу.

source: Search conditions
uk: Умови пошуку

source: After the processing of the ``FROM`` clause is done, each row of the derived virtual table can be checked against the search condition. If the result of the condition is ``true``, the row is kept in the output table, otherwise it is discarded. The ``WHERE`` clause is used to handle search condition checks.
uk: Після обробки оператора ``FROM`` кожен рядок отриманої віртуальної таблиці може бути перевірений на відповідність умові пошуку. Якщо результат умови рівний ``true``, то рядок зберігається у вихідній таблиці, інакше він відкидається. Для перевірки умови пошуку використовується оператор `WHERE`.

source: Here are some examples of ``WHERE`` clause:
uk: Ось кілька прикладів речення ``WHERE``:

source: WHERE clause usage examples
uk: Приклади використання речення WHERE

source: Grouping data
uk: Дані для групування

source: After passing the ``WHERE`` filter, the derived input table might be subject to grouping, using ``GROUP BY`` clause, and elimination of group rows using the ``HAVING`` clause. The ``GROUP BY`` clause is used to group together those rows in a table that have the same values in all the columns listed. The order in the columns are listed does not matter. The effect is to combine each set of rows having common values into one group row that represents all rows in the group. This is done to eliminate redundancy in the output and/or compute aggregates that apply to these groups.
uk: Після проходження фільтра ``WHERE`` отримана таблиця може бути згрупована за допомогою речення ``GROUP BY`` і видалена з групи рядків за допомогою речення ``HAVING``. Речення ``GROUP BY`` використовується для групування тих рядків таблиці, які мають однакові значення у всіх перелічених стовпчиках. Порядок перерахування стовпчиків не має значення. Ефект полягає в об'єднанні кожного набору рядків зі спільними значеннями в один груповий рядок, який представляє всі рядки в групі. Це робиться для того, щоб усунути надмірність у вихідних даних та/або обчислювальних агрегатах, які застосовуються до цих груп.

source: Select lists
uk: Виберіть списки

source: As shown is the previous section, the table expression in the ``SELECT`` command constructs an intermediate virtual table by possibly combining tables, views, eliminating rows, grouping etc. This table is finally passed on to processing by the *select list*. The select list determines which *columns* of the intermediate table are actually output.
uk: Як показано у попередньому розділі, вираз table у команді ``SELECT`` створює проміжну віртуальну таблицю шляхом можливого об'єднання таблиць, представлень, вилучення рядків, групування тощо. Ця таблиця нарешті передається для обробки за допомогою *списку вибору*. Список вибору визначає, які саме *стовпці* проміжної таблиці буде виведено на екран.

source: Select list items
uk: Вибір елементів списку

source: The simplest kind of select is ``*`` which emits that the table expression produces. Otherwise, a select list is a comma-separated list of value expressions. For instance:
uk: Найпростішим видом вибору є ``*``, який виводить те, що створює табличний вираз. Інакше, список вибору - це список виразів значень, розділених комами. Наприклад:

source: Columns labels
uk: Мітки стовпців

source: The entries listed in the select list can be assigned names for subsequent processing.
uk: Записам, переліченим у списку вибору, можна присвоїти імена для подальшої обробки.

source: If no output column name is specified using ``AS``, the system will assign a default column name. For simple column references, this is the name of the referenced column. For function calls, this is the name of the function. For complex expressions, the system will generate a generic name.
uk: Якщо за допомогою ``AS`` не вказано назву вихідного стовпця, система призначить назву стовпця за замовчуванням. Для простих посилань на стовпці - це ім'я стовпця, на який є посилання. Для викликів функцій - це назва функції. Для складних виразів система згенерує загальну назву.

source: Labels are often referenced as "aliases".
uk: Етикетки часто називають "псевдонімами".

source: After the select list has been processed, the result table can optionally be subject to the elimination of duplicate rows. The ``DISTINCT`` key word is written directly after ``SELECT`` to specify this:
uk: Після обробки списку вибірки таблиця результатів може бути піддана вилученню рядків, що повторюються. Для цього безпосередньо після команди ``SELECT`` записується ключове слово ``DISTINCT``:

source: Obviously, two rows are considered distinct if they differ in at least one column value. Null values are considered equal in comparison. Alternatively, an arbitrary expression can determine what rows are to be considered distinct.
uk: Очевидно, що два рядки вважаються різними, якщо вони відрізняються принаймні в одному стовпчику. Нульові значення вважаються рівними при порівнянні. Крім того, довільний вираз може визначати, які рядки вважати різними.

source: Sorting rows
uk: Сортування рядків

source: After a query has produced an output table it can optionally be sorted. If sorting is not chosen, the rows will be returned in an unspecified order. The actual order in this case will depend on the scan and join plan types and the order on disk, but it must not be relied on.
uk: Після того, як запит створив вихідну таблицю, її можна відсортувати за бажанням. Якщо сортування не вибрано, рядки будуть повернуті в невизначеному порядку. Фактичний порядок у цьому випадку залежатиме від типів планів сканування та об'єднання, а також порядку на диску, але на нього не можна покладатися.

source: The ``ORDER BY`` clause specifies the sort order:
uk: Речення ``ORDER BY`` задає порядок сортування:

source: The sort expression(s) can be any expression that would be valid in the query's select list.
uk: Вираз(и) сортування може бути будь-яким виразом, який буде допустимим у списку вибору запиту.

source: When more than one expression is specified, the later values are used to sort rows that are equal according to the earlier values. Each expression can be followed by an option ``ASC`` or ``DESC`` keyword to set the sort direction to ascending or descending. ``ASC`` order is the default.
uk: Якщо вказано більше одного виразу, пізніші значення використовуються для сортування рядків, які є рівними за попередніми значеннями. Кожен вираз може супроводжуватися ключовим словом ``ASC`` або ``DESC`` для встановлення напрямку сортування за зростанням або спаданням. за замовчуванням використовується порядок ``ASC``.

source: The ``NULL FIRST`` and ``NULL LAST`` options can be used to determine whether null appear before or after non-null values in the sort ordering. By default, null values sort as if larger than any non-null value; that's, ``NULL FIRST`` is the default for ``DESC`` order, and ``NULL LAST`` otherwise.
uk: Опції ``NULL FIRST`` та ``NULL LAST`` можна використовувати для визначення того, чи з'являтимуться нулі до або після ненульових значень у порядку сортування. За замовчуванням, нульові значення сортуються так, ніби вони більші за будь-яке ненульове значення; тобто ``NULL FIRST`` за замовчуванням для порядку ``DESC``, а ``NULL LAST`` в іншому випадку.

source: Note that the ordering options are considered independently for each sort column. For example ``ORDER BY x, y DESC`` means ``ORDER BY x ASC, y DESC``, which is not the same as ``ORDER BY x DESC, y DESC``.
uk: Зверніть увагу, що варіанти впорядкування розглядаються незалежно для кожного стовпця сортування. Наприклад, ``ORDER BY x, y DESC`` означає ``ORDER BY x ASC, y DESC``, що не те саме, що ``ORDER BY x DESC, y DESC``.

source: A sort expression can also be the column label or number of an output column.
uk: Вираз сортування також може бути міткою стовпця або номером вихідного стовпця.

source: ``ORDER BY`` can be applied to the result of a ``UNION``, ``INTERSECT``, or ``EXCEPT`` combination, but in this case it is only permitted to sort by output column names or numbers, not by expressions.
uk: оператор ``ORDER BY`` можна застосувати до результату комбінації ``UNION``, ``INTERSECT`` або ``EXCEPT``, але в цьому випадку дозволяється сортування лише за іменами або номерами вихідних стовпців, а не за виразами.

source: Limit and Offset
uk: Ліміт і зміщення

source: ``LIMIT`` and ``OFFSET`` allow you to retrieve just a portion of the rows that are generated by the rest of the query.
uk: ``LIMIT`` і ``OFFSET`` дозволяють вам отримати лише частину рядків, згенерованих рештою запиту.

source: The query above fetches only first 10 rows from the "publisher" table.
uk: Наведений вище запит витягує лише перші 10 рядків з таблиці "publisher".

source: If a limit count is given, no more than that many rows will be returned. But possibly fewer, if the query itself yields fewer rows. ``LIMIT ALL`` is the same as omitting the ``LIMIT`` clause, as is ``LIMIT`` with ``NULL`` argument.
uk: Якщо вказано граничну кількість рядків, буде повернуто не більше цієї кількості. Але, можливо, і менше, якщо сам запит повертає менше рядків. ``LIMIT ALL`` - це те саме, що опустити пункт ``LIMIT``, так само як і ``LIMIT`` з аргументом ``NULL``.

source: ``OFFSET`` says to skip that many rows before beginning to return rows. ``OFFSET 0`` is the same as omitting the ``OFFSET`` clause, as is ``OFFSET`` with a ``NULL`` argument.
uk: ``OFFSET`` вказує пропустити стільки-то рядків перед початком повернення рядків. ``OFFSET 0`` - це те саме, що опустити вираз ``OFFSET``, так само як і ``OFFSET`` з аргументом ``NULL``.

source: The query above fetches 10 publishers starting from the 11-th one.
uk: Наведений вище запит показує 10 видавництв, починаючи з 11-го.

source: When using ``LIMIT`` and/or ``OFFSET``, it's important to use ``ORDER BY`` clause that constraints the result rows into a unique order. Otherwise you will get an unpredictable subset of the query's rows.
uk: При використанні ``LIMIT`` та/або ``OFFSET`` важливо використовувати речення ``ORDER BY``, яке обмежує рядки результатів в унікальному порядку. Інакше ви отримаєте непередбачувану підмножину рядків запиту.

source: WITH queries
uk: WITH

source: ``WITH`` provides a way to write auxiliary statements for use in a larger query. These statements, which are often referred to as :abbr:`CTE (Common Table Expression)`, can be thought of as defining temporary tables that exist just for one query. Each auxiliary statement in a ``WITH`` clause can be a ``SELECT``, ``INSERT``, ``UPDATE`` or ``DELETE``; and the ``WITH`` clause itself is attached to a primary statement that can be a ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` or ``MERGE``.
uk: Команда ``WITH`` надає можливість писати допоміжні оператори для використання у великих запитах. Ці оператори, які часто називають :abbr:`CTE (Common Table Expression)`, можна розглядати як визначення тимчасових таблиць, які існують лише для одного запиту. Кожен допоміжний оператор у реченні ``WITH`` може бути оператором ``SELECT``, ``INSERT``, ``UPDATE`` або ``DELETE``; а саме речення ``WITH`` приєднується до основного оператора, який може бути оператором ``SELECT``, ``INSERT``, ``UPDATE``, ``DELETE`` або ``MERGE``.

source: Select in WITH
uk: Вибірка у WITH

source: The basic value of ``SELECT`` in ``WITH`` is to break down complicated queries into simpler parts.
uk: Основне значення ``SELECT`` у ``WITH`` полягає в тому, щоб розбивати складні запити на простіші частини.

source: Get most profitable months
uk: Отримайте найприбутковіші місяці

source: Recursive queries
uk: Рекурсивні запити

source: The optional ``RECURSIVE`` modifier changes WITH from a mere syntactic convenience into a feature that accomplishes things not otherwise possible in standard SQL. Using ``RECURSIVE``, a ``WITH`` query can refer to its own output.
uk: Додатковий модифікатор ``RECURSIVE`` перетворює WITH з простої синтаксичної зручності на функцію, яка виконує речі, неможливі у стандартному SQL. Використовуючи ``RECURSIVE``, запит ``WITH`` може посилатися на свій власний вивід.

source: Sum of first 10 numbers starting from 1
uk: Сума перших 10 чисел, починаючи з 1

source: When working with recursive queries it is important to be sure that the recursive part of the query will eventually return no tuple, or else the query will loop indefinitely.
uk: При роботі з рекурсивними запитами важливо бути впевненим, що рекурсивна частина запиту в кінцевому підсумку не поверне жодного кортежу, інакше запит зациклиться на невизначений час.

source: Data modifying statements in WITH
uk: Оператори, що модифікують дані в операторі WITH

source: You can use most data-modifying statements (``INSERT``, ``UPDATE``, ``DELETE``) in ``WITH``. This allows you to perform several different operations at a time, in the same query.
uk: Ви можете використовувати більшість операторів модифікації даних (``INSERT``, ``UPDATE``, ``DELETE``) в ``WITH``. Це дозволяє виконувати кілька різних операцій одночасно в одному запиті.

source: Remove old revenue records and store them into history table
uk: Видаліть старі записи про доходи та збережіть їх у таблиці історії

source: Combining queries
uk: Об'єднання запитів

source: The results of two queries can be combined using the set operations union, intersection, and difference.
uk: Результати двох запитів можна об'єднати за допомогою операцій об'єднання, перетину та різниці.

source: ``UNION`` effectively appends the result of ``query2`` to the result of ``query1`` (although there is no guarantee that this is the order in which the rows are actually returned). Furthermore, it eliminates duplicate rows from its result, in the same way as ``DISTINCT``, unless ``UNION ALL`` is used.
uk: ``UNION`` ефективно додає результат ``query2`` до результату ``query1`` (хоча немає жодних гарантій, що це саме той порядок, в якому повертаються рядки). Крім того, вона вилучає з результату повторювані рядки так само, як і ``DISTINCT``, якщо не використовується ``UNION ALL``.

source: ``INTERSECT`` returns all rows that are both in the result of ``query1`` and in the result of ``query2``. Duplicate rows are eliminated unless ``INTERSECT ALL`` is used.
uk: ``INTERSECT`` повертає всі рядки, які є і в результаті ``query1``, і в результаті ``query2``. Повторювані рядки вилучаються, якщо не використовується ``INTERSECT ALL``.

source: ``EXCEPT`` returns all rows that are in the result of ``query1`` but not in the result of ``query2``. (This is sometimes called the difference between two queries.) Again, duplicates are eliminated unless ``EXCEPT ALL`` is used.
uk: ``EXCEPT`` повертає всі рядки, які є в результаті ``query1``, але не є в результаті ``query2``. (Це іноді називають різницею між двома запитами.) Знову ж таки, дублікати вилучаються, якщо не використовується ``EXCEPT ALL``.

source: Join data from different tables
uk: Об'єднання даних з різних таблиць

source: A ``JOIN`` clause combines two ``FROM`` items, which for convenience we will refer as "tables", though in reality they can be any type of ``FROM`` items. Available join types are:
uk: Речення ``JOIN`` об'єднує два елементи ``FROM``, які для зручності будемо називати "таблицями", хоча насправді це може бути будь-який тип елементів ``FROM``. Доступні типи з'єднання:

source: Key words in bracket parentheses above are optional.
uk: Ключові слова в дужках вище є необов'язковими.

source: Joins between tables
uk: З'єднання між столами

source: Publishers and books tables definitions
uk: Визначення таблиць видавництв та книг

source: Following tables are related via ``FOREIGN KEY`` constraint. Each record in the ``book`` table references some record in the ``publisher`` table.
uk: Наступні таблиці пов'язані між собою за допомогою обмеження ``FOREIGN KEY``. Кожен запис у таблиці ``book`` посилається на деякий запис у таблиці ``publisher``.

source: Since original tables contain lots of data, temporary tables will be created instead before join query. Full tables content may be downloaded via links: :download:`publisher </../libms-db/assets/csv/publisher.csv>`, :download:`book </../libms-db/assets/csv/book.csv>`.
uk: Оскільки вихідні таблиці містять багато даних, перед об'єднанням запитів буде створено тимчасові таблиці. Повний вміст таблиць можна завантажити за посиланнями: :download:`publisher </../libms-db/assets/csv/publisher.csv>`, :download:`book </../libms-db/assets/csv/book.csv>`.

source: The subsets from original queries defined as:
uk: Підмножини з вихідних запитів визначаються як:

source: By passing multiple tables to the ``FROM`` clause a ``CROSS JOIN`` query is executed. This means the resulting table is the Cartesian product of two original tables.
uk: При передачі декількох таблиць в речення ``FROM`` виконується запит ``CROSS JOIN`` (перехресне об'єднання). Це означає, що результуюча таблиця є декартовим добутком двох вихідних таблиць.

source: Cross join (Cartesian product)
uk: Поперечне з'єднання (декартовий добуток)

source: Query result
uk: Результат запиту

source: By defining the ``WHERE`` clause rows that do not match the condition may be eliminated from the result.
uk: За допомогою оператора `WHERE` рядки, які не відповідають умові, можуть бути вилучені з результату.
