Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/basics/decorators.po
Languages: uk

source: Python decorators
uk: Декоратори в Python

source: Decorators
uk: Декоратори

source: Decorators provide a simple syntax for calling higher-order functions :cite:`realpython:decorators`.
uk: Декоратори надають простий синтаксис для виклику функцій вищого порядку :cite:`realpython:decorators`.

source: There is some kind of misunderstanding in definitions.
uk: Існує певне непорозуміння у визначеннях.

source: Before you understand decorators, you must first understand how functions work.
uk: Перш ніж розбиратися в декораторах, потрібно зрозуміти, як працюють функції.

source: First-class objects
uk: Об'єкти першого класу

source: In Python functions are `first-class objects`_. Everything in Python is an object. Functions are objects too.
uk: У Python функції є `об'єктами першого класу`_. Усе в Python є об'єктом. Функції також є об'єктами.

source: Inner functions
uk: Внутрішні функції

source: Functions can be nested. This means it is possible to define functions inside other functions.
uk: Функції можуть бути вкладеними. Це означає, що можна визначати функції всередині інших функцій.

source: Nested functions example
uk: Приклад вкладених функцій

source: The order in which inner functions are defined no matters. The function definition does not execute the function body; this gets executed only when the function is called. Furthermore, the inner functions are not defined until the parent function is called. They are locally scoped to their parent. Trying to call ``heapify`` function outside of ``heap_sort`` will cause ``NameError`` exception.
uk: Порядок визначення внутрішніх функцій не має значення. Визначення функції не виконує тіло функції; воно виконується лише під час виклику функції. Крім того, внутрішні функції не визначаються до виклику батьківської функції. Вони локально масштабуються до свого батька. Спроба викликати функцію ``heapify`` поза ``heap_sort`` призведе до виключення ``NameError``.

source: Functions are objects
uk: Функції є об'єктами

source: This means functions can be passed around and used as arguments, just like any other object (e.g. *int*, *str* etc.).
uk: Це означає, що функції можна передавати і використовувати як аргументи так само, як і будь-які інші об'єкти (наприклад, *int*, *str* тощо).

source: Returning functions
uk: Повернення функцій

source: Since function can be passed as an argument, it may be returned from another function.
uk: Оскільки функція може бути передана як аргумент, вона може бути повернута з іншої функції.

source: ``parent`` returns functions themselves, there are no parentheses.
uk: ``parent`` повертає самі функції, дужок немає.

source: After running the code snippet above, ``first`` refers the ``first_child`` function from the inner ``parent`` scope. From now it can be used to call the target function it refers.
uk: Після виконання наведеного вище фрагмента коду, ``first`` звертається до функції ``first_child`` з внутрішньої області видимості ``parent``. Тепер її можна використовувати для виклику цільової функції, на яку вона посилається.

source: Simple decorators
uk: Прості декоратори

source: Now you're ready to move on and see the magical beast that is the Python decorators. Let's start with a simple example:
uk: Тепер ви готові рухатися далі і побачити чарівного звіра, яким є декоратори Python. Почнемо з простого прикладу:

source: Running function:
uk: Запуск функцій:

source: The common way to use decorators is to replace the original function with a decorated one:
uk: Найпоширеніший спосіб використання декораторів - це заміна оригінальної функції на декоровану:

source: ``say_hello`` function is the reference to the ``decorator.<locals>.wrapper``, which itself is bound to the original ``say_hello`` function. There is a syntactic sugar to do this, called *pie-syntax*. The following example does exact the same things as the first decorator example:
uk: Функція ``say_hello`` є посиланням на ``decorator.<locals>.wrapper``, яка сама зв'язана з оригінальною функцією ``say_hello``. Для цього існує синтаксичний цукор, який називається *pie-синтаксис*. Наступний приклад робить те саме, що і перший приклад декоратора:

source: There is no way to *undecorate* object in Python. Once something is bound to the decorator's wrapper - it is decorated forever.
uk: У Python не існує способу *роздекорувати* об'єкт. Як тільки щось прив'язано до обгортки декоратора - воно прикрашене назавжди.

source: A decorated function still remains a **function**. So, it can be decorated once more time again, and again, and again...
uk: Прикрашена функція все одно залишається **функцією**. Отже, її можна прикрасити ще раз, і ще раз, і ще раз, і ще раз...

source: "Wrapper" is the alternative nickname for the Decorator pattern that clearly expresses the main idea of the pattern. A wrapper is an object that can be linked with some target object. The wrapper contains the same set of methods as the target and delegates to it all requests it receives. However, the wrapper may alter the result by doing something either before or after it passes the request to the target.
uk: "Обгортка" - це альтернативна назва шаблону "Декоратор", яка чітко виражає основну ідею шаблону. Обгортка - це об'єкт, який можна зв'язати з деяким цільовим об'єктом. Обгортка містить той самий набір методів, що й цільовий об'єкт, і делегує йому всі запити, які він отримує. Однак обгортка може змінити результат, виконавши щось до або після передачі запиту цільовому об'єкту.

source: Passing arguments to the wrapper
uk: Передача аргументів в обгортку

source: Until now the examples use *simple* decorators. But what if the decorated function gets some arguments? This will cause ``TypeError`` exception that tell that "arguments are missed". This can be fixed with just passing arguments to the ``wrapper`` inner function.
uk: Досі у прикладах використовувались *прості* декоратори. Але що, якщо декорована функція отримає якісь аргументи? Це викличе виключення ``TypeError``, яке скаже, що "аргументи пропущено". Це можна виправити, просто передавши аргументи у внутрішню функцію ``wrapper``.

source: If case you're trying to make a generic decorator, you may pass ``*args`` and ``**kwargs`` instead of exact arguments:
uk: Якщо ви намагаєтеся створити узагальнений декоратор, ви можете передати ``*args`` і ``**kwargs`` замість точних аргументів:

source: Passing arguments to decorator
uk: Передача аргументів до декоратора

source: At last it's time to know how to pass arguments to the decorator. Here is a simple implementation of ``defer`` decorator which deferred the function execution for some time:
uk: Нарешті прийшов час дізнатися, як передавати аргументи декоратору. Ось проста реалізація декоратора ``defer``, який відкладає виконання функції на деякий час:

source: Class decorators
uk: Декоратори класів

source: There are some pre-defined decorators exists for usage together with classes. They are:
uk: Існує декілька попередньо визначених декораторів для використання разом з класами. Ось вони:

source: If you develop an intuitive understanding for their differences you'll be able to write object-oriented Python that communicates its intent more clearly and will be easier to maintain in the long run :cite:`realpython:methods-demystified`.
uk: Якщо ви розвинете інтуїтивне розуміння їх відмінностей, ви зможете писати об'єктно-орієнтований Python, який більш чітко передає свої наміри і який буде легше підтримувати в довгостроковій перспективі :cite:`realpython:methods-demystified`.

source: Class methods
uk: Методи класу

source: Instead of accepting a ``self`` parameter, class methods take a ``cls`` parameter that points to the class — and not the object instance — when the method is called.
uk: Замість того, щоб приймати параметр ``self``, методи класу приймають параметр ``cls``, який вказує на клас - а не на екземпляр об'єкта - під час виклику методу.

source: Because the class method only has access to this ``cls`` argument, it can't modify object instance state. That would require access to ``self``. However, class methods can still modify class state that applies across all instances of the class.
uk: Оскільки метод класу має доступ лише до цього аргументу ``cls``, він не може змінювати стан екземпляра об'єкта. Для цього потрібен доступ до ``self``. Однак, методи класу все ще можуть змінювати стан класу, який застосовується до всіх екземплярів класу.

source: The common usage for ``classmethod`` is provide alternative initializers.
uk: Загальноприйнятим використанням ``classmethod`` є надання альтернативних ініціалізаторів.

source: Static methods
uk: Статичні методи

source: This type of method takes neither a ``self`` nor a ``cls`` parameter (but of course it's free to accept an arbitrary number of other parameters).
uk: Цей тип методів не приймає ні параметра ``self``, ні параметра ``cls`` (але, звичайно, він може приймати довільну кількість інших параметрів).

source: Therefore a static method can neither modify object state nor class state. Static methods are restricted in what data they can access - and they're primarily a way to namespace your methods.
uk: Тому статичний метод не може змінювати стан об'єкта або класу. Статичні методи обмежені в доступі до даних, до яких вони можуть отримати доступ - і це, насамперед, спосіб організації простору імен ваших методів.

source: It's tricky to explain ``staticmethod`` usage. Almost always you can create a dedicated function instead of static method. But sometimes you need to bind some logic independent from class itself or its instances to a class - it common to encapsulate it with ``staticmethod``.
uk: Пояснити використання ``staticmethod`` досить складно. Майже завжди замість статичного методу можна створити спеціальну функцію. Але іноді вам потрібно прив'язати до класу деяку логіку, незалежну від самого класу або його екземплярів, і тоді прийнято інкапсулювати її за допомогою ``staticmethod``.

source: Properties
uk: Властивості

source: It's a way to bind a method name to access it as an attribute. Properties are **read-only** by default. This means a value cannot be assigned to ``property member``.
uk: Це спосіб зв'язати ім'я методу для доступу до нього як до атрибуту. За замовчуванням властивості доступні лише для читання. Це означає, що члену властивості не можна присвоїти значення.

source: Some examples
uk: Деякі приклади
