Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/basics/functions.po
Languages: uk

source: Python functions
uk: Функції в Python

source: Functions
uk: Функції

source: You may be familiar with the mathematical concept of a **function**. It is a relationship or mapping between one or more inputs and a set of outputs.
uk: Можливо, ви знайомі з математичним поняттям **функція**. Це відношення між одним або декількома вхідними параметрами та набором результатів.

source: Here ``f`` is a function that operates on the inputs ``x`` and ``y``, and its output is bind to ``z``.
uk: Тут ``f`` - це функція, яка оперує параметрами ``x`` та ``y``, а її результат прив'язаний до ``z``.

source: In programming a **function** is a self-contained block of code that encapsulate a specific task or related group of tasks.
uk: У програмуванні **функція** - це автономний блок коду, який інкапсулює певну задачу або пов'язану групу задач.

source: You may be familiar with some built-in functions like ``max``, ``min``, ``len`` etc.
uk: Ви можете бути знайомі з деякими вбудованими функціями, такими як ``max``, ``min``, ``len`` тощо.

source: The usual syntax for defining a Python function is as follows:
uk: Звичайний синтаксис для визначення функції Python наступний:

source: Component
uk: Компонент

source: Meaning
uk: Значення

source: The keyword that informs Python that a function is being defined
uk: Ключове слово, яке інформує Python про те, що визначається функція

source: A valid Python identifier that names the function
uk: Валідний ідентифікатор Python, який називає функцію

source: An optional, comma-separated list of parameters that may be passed to the function
uk: Необов'язковий список параметрів через кому, які можуть бути передані у функцію

source: A block of valid Python statements; **body** of the function
uk: Блок допустимих операторів Python; **тіло** функції

source: The syntax for calling a Python function is as follows:
uk: Синтаксис виклику функції Python наступний:

source: The ``<arguments>`` are the values passed into the function. They correspond to the ``<parameters>`` in the function definition. You can define a function that doesn't take any arguments, but the parentheses are still required. Both a function definition and a function call must always include parentheses, even if they're empty.
uk: Значення ``<arguments>`` - це значення, що передаються у функцію. Вони відповідають ``<parameters>`` у визначенні функції. Ви можете визначити функцію, яка не приймає жодних аргументів, але дужки все одно є обов'язковими. І визначення функції, і її виклик завжди повинні містити дужки, навіть якщо вони порожні.

source: Argument passing
uk: Передача аргументів

source: More often, you want to **pass data into a function**.
uk: Найчастіше вам потрібно **передати дані у функцію**.

source: Positional arguments
uk: Позиційні аргументи

source: Because of the way they're defined and used, positional arguments are also called *required arguments*.
uk: Через те, як вони визначаються і використовуються, позиційні аргументи також називають *обов'язковими аргументами*.

source: The most straightforward way to pass arguments to a function is with **positional arguments**. In the function definition, you specify a comma-separated list of parameters inside the parentheses. When the function is called, you specify a corresponding list of arguments.
uk: Найпростіший спосіб передачі аргументів у функцію - за допомогою **позиційних аргументів**. У визначенні функції ви вказуєте список параметрів, розділених комами, всередині круглих дужок. Коли функція викликається, ви вказуєте відповідний список аргументів.

source: The parameters behave like **variables** that are defined locally to the function.
uk: Параметри поводяться як **змінні**, визначені локально у функції.

source: Although positional arguments are the most straightforward way to pass data to a function, they also afford the least flexibility. For starters, the **order** of the arguments in the call must match the order of the parameters in the definition.
uk: Хоча позиційні аргументи є найпростішим способом передачі даних у функцію, вони також забезпечують найменшу гнучкість. Для початку, **порядок** аргументів у виклику повинен відповідати порядку параметрів у визначенні.

source: There's nothing to stop you from specifying positional arguments out of order. The function even may still run, but it's very unlikely to produce the correct results.
uk: Ніщо не заважає вам вказати позиційні аргументи в неправильному порядку. Функція навіть може запуститися, але навряд чи видасть правильні результати.

source: It's responsibility of the programmer who defines the function to document what the appropriate arguments should be, and it's the responsibility of the user of the function to be aware of that information and abide by it.
uk: Програміст, який визначає функцію, зобов'язаний задокументувати, якими мають бути відповідні аргументи, а користувач функції зобов'язаний знати цю інформацію і дотримуватися її.

source: With positional arguments, the arguments in the call and the parameters in the definition must agree not only in order, but in number as well.
uk: З позиційними аргументами аргументи у виклику та параметри у визначенні повинні узгоджуватися не тільки за порядком, але й за кількістю.

source: Keyword arguments
uk: Аргументи за ключовими словами

source: When calling a function, you can specify arguments in the form ``<keyword>=<value>``. In that case, each ``<keyword>`` must match a parameter in the function definition. Referencing a keyword that doesn't match any of these declared parameters generates an exception.
uk: При виклику функції можна вказувати аргументи у вигляді ``<keyword>=<value>``. У цьому випадку кожен ``<keyword>`` повинен відповідати параметру у визначенні функції. Звернення до ключового слова, яке не відповідає жодному з цих оголошених параметрів, генерує виключення.

source: Using keyword arguments lifts the restriction on arguments order. Each keyword argument explicitly designates a specific parameter by name, so you can specify them in any order and Python will still know which argument goes with which parameter.
uk: Використання аргументів з ключовими словами знімає обмеження на порядок аргументів. Кожне ключове слово-аргумент явно вказує на конкретний параметр за назвою, тому ви можете вказати їх у довільному порядку, і Python все одно знатиме, який аргумент йде з яким параметром.

source: Like with positional arguments, though, the number of arguments and parameters must still match.
uk: Як і у випадку з позиційними аргументами, кількість аргументів і параметрів має збігатися.

source: You can call a function using both positional and keyword arguments. Once you've specified a keyword argument, there can't be any positional arguments to the right of it.
uk: Ви можете викликати функцію, використовуючи як позиційні, так і ключові аргументи. Після того, як ви вказали ключове слово, праворуч від нього не може бути жодних позиційних аргументів.

source: Default values
uk: Значення за замовчуванням

source: If a parameter specified in the function definition has the form of ``<name>==<value>``, then ``<value>`` becomes a default value for that parameter. Parameters defined this way are referred to as **default or optional parameters**.
uk: Якщо параметр, вказаний у визначенні функції, має вигляд ``<name>==<value>``, то значенням за замовчуванням для цього параметра стає ``<value>``. Параметри, визначені таким чином, називаються **параметрами за замовчуванням або необов'язковими параметрами**.

source: Mutable default parameter values
uk: Змінювані значення параметрів за замовчуванням

source: Things can get weird if you specify a default parameter value that is a mutable object.
uk: Ситуація може ускладнитися, якщо ви вкажете значення параметра за замовчуванням, який є змінюваним об'єктом.

source: In Python default parameter values are **defined only once** when the function is defined. The default value isn't re-defined each time the function is called. For the example above, each time the ``add_to_container`` function is called without passing ``container`` argument, the ``.append`` statement is performed on the same list.
uk: У Python значення параметрів за замовчуванням **визначаються лише один раз** під час визначення функції. Значення за замовчуванням не перевизначається при кожному виклику функції. У наведеному вище прикладі кожного разу, коли функція ``add_to_container`` викликається без передачі аргументу ``container``, оператор ``.append`` виконується над тим самим списком.

source: Mutable and immutable arguments
uk: Змінні та незмінні аргументи

source: Roughly, you may consider immutable object as passed-by-value, and mutable objects as passed-by-reference. However, that's not actual true.
uk: Грубо кажучи, ви можете вважати незмінний об'єкт переданим значенням, а змінювані об'єкти - переданим посиланням. Однак, це не зовсім так.

source: In programming language design, there are two common paradigms for passing an argument to a function:
uk: У мові програмування існує дві поширені парадигми передачі аргументу у функцію:

source: **pass-by-value** means a copy of the argument is passed to the function.
uk: **передати-за-значенням** означає, що у функцію передається копія аргументу.

source: **pass-by-reference** means a reference to the argument is passed to the function.
uk: **передати-за-посиланням** означає, що у функцію передається посилання на аргумент.

source: Are parameters in Python pass-by-value or pass-by-reference? They're neither, exactly. That's because a reference doesn't mean quite the same thing in Python as it does in C-like languages.
uk: Чи є параметри в Python переданими за значенням або за посиланням? Вони не є ні тими, ні іншими. Це тому, що посилання в Python означає не зовсім те саме, що в C-подібних мовах.

source: Recall that in Python, every piece of data is an **object**. A reference points to an object, not a specific memory location.
uk: Нагадаємо, що у Python кожен фрагмент даних є **об'єктом**. Посилання вказує на об'єкт, а не на конкретну ділянку пам'яті.

source: Take a look on the code below:
uk: Погляньте на код нижче:

source: These assignment statements have the following meaning:
uk: Ці оператори присвоювання мають наступне значення:

source: **Line 1** cause ``value`` to point to an object whose value is ``24``.
uk: **Рядок 1** призводить до того, що ``value`` вказує на об'єкт, значенням якого є ``24``.

source: **Line 2** reassign ``value`` as a new reference to a different object whose value is ``42``.
uk: **Рядок 2** перепризначає ``value`` як нове посилання на інший об'єкт, значенням якого є ``42``.

source: In Python, when you pass an argument to a function, a similar *rebinding* occurs.
uk: У Python, коли ви передаєте аргумент у функцію, відбувається аналогічне *переприв'язування*.

source: In the main program, the statement ``x = 5`` on line 5 creates a reference named ``x`` bound to an object whose value is ``5``. ``reassign`` is then called on line 6 with ``x`` as its argument. When a function first starts, a new reference called ``fx`` is created, which initially points to the same ``5`` object. However, when the statement ``fx = 10`` on line 2 is executed, ``reassign`` rebinds ``fx`` to a new object whose value is ``10``. From now, the two references ``x`` and ``fx`` are uncoupled one from another. Nothing else that function does will affect ``x``, and when function terminates, ``x`` will still point to the object ``5``, as it did prior to the function call.
uk: В основній програмі оператор ``x = 5`` у рядку 5 створює посилання з іменем ``x``, пов'язане з об'єктом, значенням якого є ``5``. потім у рядку 6 викликається функція ``reassign`` з ``x`` як аргументом. При першому запуску функції створюється нове посилання ``fx``, яке спочатку вказує на той самий об'єкт ``5``. Однак, коли виконується оператор ``fx = 10`` у рядку 2, ``reassign`` перепризначає ``fx`` на новий об'єкт, значенням якого є ``10``. Відтепер два посилання ``x`` і ``fx`` від'єднано одне від одного. Ніякі інші дії функції не вплинуть на ``x``, і коли функція завершиться, ``x`` все ще вказуватиме на об'єкт ``5``, як це було до виклику функції.

source: You can confirm all this using ``id()``. Here's a slightly augmented version of the code above:
uk: Ви можете підтвердити все це за допомогою ``id()``. Ось дещо доповнена версія коду вище:

source: The outputs will look like:
uk: Результати будуть виглядати так:

source: Python's argument-passing mechanism has been called **pass-by-assignment**. You may also see terms pass-by-object, pass-by-object-reference, or pass-by-sharing. This is because parameter names are bound to objects on function entry in Python, and assignment is also the process of binding a name to an object.
uk: Механізм передачі аргументів у Python називається **передача-за-присвоєнням** (**pass-by-assignment**). Ви також можете зустріти терміни pass-by-object, pass-by-object-reference або pass-by-sharing. Це пов'язано з тим, що імена параметрів прив'язуються до об'єктів під час виклику функції у Python, а присвоювання - це також процес прив'язки імені до об'єкта.

source: The key takeaway here is that Python function can't change the value of an argument by reassigning the corresponding parameter to something else.
uk: Ключовим моментом тут є те, що функція Python не може змінити значення аргументу, перепризначивши відповідний параметр на щось інше.

source: However, functions can use references to make modifications inside of a mutable objects.
uk: Однак, функції можуть використовувати посилання для модифікацій всередині змінюваних об'єктів.

source: The return statement
uk: Оператор повернення

source: It serves two purposes:
uk: Він служить двом цілям:

source: It immediately terminates the function and passes execution control back to the caller.
uk: Він негайно завершує функцію і передає керування виконанням назад тому, хто її викликав.

source: It provides a mechanism by which the function can pass data back to the caller.
uk: Він надає механізм, за допомогою якого функція може передавати дані назад тому, хто її викликає.

source: The return statement can be used inside of a function or a method to send the result back to the caller. It consists of the ``return`` Python keyword and an optional return value.
uk: Оператор return можна використовувати всередині функції або методу, щоб відправити результат назад тому, хто його викликає. Він складається з ключового слова ``return`` та необов'язкового значення, що повертається.

source: The return value of a Python function can be any Python object (and you should remember - everything in Python is an object).
uk: Значенням, що повертається функцією, може бути будь-який об'єкт Python (і ви повинні пам'ятати - все в Python є об'єктом).

source: You can omit the return value and use bare ``return`` without a return value. You can also omit the entire ``return`` statement. In both cases, the return value will be ``None``. So, Python functions always have the return value; in case it hasn't been specified - it's ``None``.
uk: Ви можете опустити значення, що повертається, і використовувати просто ``return`` без значення, що повертається. Ви також можете опустити всю інструкцію ``return``. В обох випадках значенням, що повертається, буде ``None``. Отже, функції Python завжди мають значення, що повертається, а якщо його не вказано - це ``None``.

source: **Returning vs Printing**
uk: **return проти print**

source: If you're working in an interactive session, then you might think that printing a value and returning a value are equivalent. Consider the following two functions:
uk: Якщо ви працюєте в інтерактивному сеансі, ви можете подумати, що виведення значення і повернення значення еквівалентні. Розглянемо дві наступні функції:

source: And their output:
uk: Та результати їх викликів:

source: Both functions seems to do the same thing. But only the second one function actually returns a value, when the first one returns nothing (or **NoneType object**).
uk: Здається, що обидві функції роблять одне й те саме. Але тільки друга функція насправді повертає значення, тоді як перша не повертає нічого (або **NoneType об'єкт**).

source: Return multiple values
uk: Повернення декількох значень

source: You can use a return statement to return multiple values from a function. To do that, you just need to supply several return values separated by commas. The function will return a tuple of values.
uk: Ви можете використовувати інструкцію return для повернення декількох значень з функції. Для цього вам просто потрібно вказати декілька значень, що повертаються, розділених комами. Функція поверне їх як кортеж.

source: The built-in ``divmod`` function is also an example of a function that returns multiple values. The function takes two (non-complex) numbers as arguments and returns two numbers, the quotient of the two input values and the remainder of the division.
uk: Вбудована функція ``divmod`` також є прикладом функції, яка повертає декілька значень. Функція отримує два (нескладних) числа як аргументи і повертає два числа - частку від ділення двох вхідних значень і залишок від ділення.

source: Variable-length argument list
uk: Список аргументів змінної довжини

source: In some cases, when you're defining a function, you may not know beforehand how many arguments you'll want it to take.
uk: У деяких випадках, коли ви визначаєте функцію, ви можете не знати заздалегідь, скільки аргументів ви хочете, щоб вона приймала.

source: For example, a function that computes an average of several values may look something like this:
uk: Наприклад, функція, яка обчислює середнє арифметичне декількох значень, може виглядати приблизно так:

source: However, as you're already seen, when positional arguments are used, the number of arguments passed must match the number of parameters declared.
uk: Однак, як ви вже бачили, коли використовуються позиційні аргументи, кількість переданих аргументів повинна відповідати кількості оголошених параметрів.

source: Argument tuple packing
uk: Пакування аргументів до кортежа

source: When a parameter name in a function definition is preceded by an asterisk (\*), it indicates **argument tuple packing**. Any corresponding arguments in a function call are packed into a tuple that the function can refer to by the given parameter name.
uk: Коли імені параметра у визначенні функції передує зірочка (\*), це означає **упакування кортежу аргументів**. Будь-які відповідні аргументи у виклику функції упаковуються у кортеж, на який функція може посилатися за вказаним іменем параметра.

source: Any name can be used, but *args* is so commonly chosen that it's practically a standard.
uk: Можна використовувати будь-яке ім'я, але *args* є настільки поширеним, що стало практично стандартом.

source: Argument tuple unpacking
uk: Розпакування кортежу аргументів

source: An analogous operation is available on the other side of the equation in a function call. When an argument in a function call is preceded by an asterisk, it indicates that the argument is a tuple that should be **unpacked** and passed to the function as separate values.
uk: Аналогічна операція доступна з іншого боку рівняння у виклику функції. Якщо перед аргументом у виклику функції стоїть зірочка, це означає, що аргумент є кортежем, який слід **розпакувати** і передати у функцію як окремі значення.

source: Although this type of unpacking is called **tuple** unpacking, it doesn't only work with tuples. The asterisk can be applied to any iterable in a function call.
uk: Хоча цей тип розпакування називається **розпакуванням кортежів**, він працює не лише з кортежами. Зірочка може бути застосована до будь-якого ітеруємого об'єкта у виклику функції.

source: You can even do tuple packing and unpacking at the same time.
uk: Ви навіть можете одночасно пакувати та розпаковувати кортежі.

source: Argument dictionary packing
uk: Пакування аргументів до словника

source: Python has a similar operator, the double asterisk (\*\*), which can be used with function parameters to specify **dictionary packing**. Preceding parameter in a function definition be a double asterisk indicates that the corresponding arguments, which are expected to be keyword arguments (``key=value`` pairs), should be packed into a dictionary.
uk: У мові Python є подібний оператор, подвійна зірочка (\*\*), який можна використовувати з параметрами функції для вказівки **пакування словників**. Передування параметру у визначенні функції подвійною зірочкою вказує на те, що відповідні аргументи, які, як очікується, є аргументами ключових слів (пари ``ключ=значення``), мають бути упаковані у словник.

source: Again, any name can be used, but the peculiar *kwargs* (which is short for *keyword args*) is nearly standard.
uk: Знову ж таки, можна використовувати будь-яке ім'я, але особливе *kwargs* (що є скороченням від *keyword args*) є майже стандартним.

source: Argument dictionary unpacking
uk: Розапакування аргументів зі словника

source: This is analogous to argument tuple unpacking. When the double asterisk precedes an argument in a function call, it specifies that the argument is a dictionary that should be unpacked, with the resulting items passed to the function as keyword arguments.
uk: Це аналогічно розпакуванню кортежу аргументів. Коли подвійна зірочка стоїть перед аргументом у виклику функції, вона вказує на те, що аргумент є словником, який слід розпакувати, а отримані елементи передати у функцію як аргументи ключових слів.

source: Lambda functions
uk: Лямбда функції

source: Lambda expressions in Python and other programming languages have their roots in lambda calculus, a model of computation invented by Alonzo Church. Python is not inherently a functional language, but it adopted some functional concepts early on. In January 1994, ``map()``, ``filter()``, ``reduce()``, and the lambda operator were added to the language.
uk: Лямбда-вирази в Python та інших мовах програмування беруть свій початок у лямбда-обчисленні - моделі обчислень, винайденій Алонзо Черчем. За своєю суттю Python не є функціональною мовою, але вона рано перейняла деякі функціональні концепції. У січні 1994 року до мови було додано ``map()``, ``filter()``, ``reduce()`` та лямбда-оператор.

source: General lambda function syntax is:
uk: Загальний синтаксис лямбда-функції такий:

source: A valid Python expression; return statement
uk: Валідний вираз Python; оператор повернення

source: The code sample above demonstrates the ``get_fullname`` Python function and its lambda version. A lambda form presents syntactic distinctions from a normal function. In particular, a lambda function has the following characteristics:
uk: Наведений вище приклад коду демонструє функцію Python ``get_fullname`` та її лямбда-версію. Лямбда-форма має синтаксичні відмінності від звичайної функції. Зокрема, лямбда-функція має наступні характеристики:

source: It can only contain expressions and can’t include statements in its body.
uk: Він може містити лише вирази і не може включати в себе оператори.

source: It is written as a single line of execution.
uk: Він написаний у вигляді одного рядка виконання.

source: It does not support type annotations.
uk: Він не підтримує анотації типів.

source: It can be immediately invoked (:abbr:`IIFE (Immediately Invoked Function Execution)`).
uk: Її можна негайно викликати (:abbr:`IIFE (Immediately Invoked Function Execution)`).

source: Classic functional constructs
uk: Класичні функціональні конструкції
