Repository: PonomaryovVladyslav/PythonCourses
Catalog: src/_locales/*/LC_MESSAGES/basics/stdtypes.po
Languages: uk

source: Python built-in types
uk: Вбудовані типи даних в Python

source: Built-in Types
uk: Вбудовані Типи

source: The principal built-in types are numerics, sequences, mappings, classes, instances and exceptions :cite:`docs-python:stdtypes`. This section covers only the most base of them. Others will be discussed in the future within their own topics.
uk: Основними вбудованими типами є числа, послідовності, словники, класи, екземпляри та винятки :cite:`docs-python:stdtypes`. У цьому розділі розглянуто лише найпростіші з них. Інші будуть розглянуті в майбутньому у відповідних темах.

source: Numeric types
uk: Числові типи

source: There are 3 distinct numeric types: *integers*, *floating point numbers*, and *complex numbers*. In addition, Booleans are a subtype of integers. Integers have unlimited precision. Floating point numbers are usually implemented using ``double`` in C. Complex numbers have a real and imaginary part, which are each a floating point number.
uk: Існує 3 різних числових типи: *цілі числа*, *числа з плаваючою комою* та *комплексні числа*. Крім того, булеві значення є підтипом цілих чисел. Цілі числа мають необмежену точність. Числа з плаваючою комою зазвичай реалізуються за допомогою ``double`` у C. Комплексні числа мають дійсну та уявну частини, кожна з яких є числом з плаваючою комою.

source: Numbers are created by numeric literals or as the result of built-in functions and operators. Unadorned integer literals (including hex, octal and binary numbers) yield integers. Numeric literals containing a decimal point or an exponent sign yield floating point numbers. Appending ``j`` or ``J`` to a numeric literal yields an imaginary number (a complex number with a zero real part) which you can add to an integer or float to get a complex number with real and imaginary parts.
uk: Числа створюються за допомогою числових літералів або як результат вбудованих функцій та операторів. Цілочислені літерали без додатків (включаючи шістнадцяткові, вісімкові та двійкові числа) створюють цілі числа. Числові літерали, що містять десяткову крапку або знак експоненти, дають числа з плаваючою комою. Додавання ``j`` або ``J`` до числового літерала дає уявне число (комплексне число з нульовою дійсною частиною), яке ви можете додати до цілого числа або числа з плаваючою комою, щоб отримати комплексне число з дійсною та уявною частинами.

source: Supported operations
uk: Операції, які підтримуються

source: Operation
uk: Операція

source: Result
uk: Результат

source: sum of *x* and *y*
uk: сума *x* і *y*

source: difference of *x* and *y*
uk: різниця *x* і *y*

source: product of *x* and *y*
uk: добуток *x* і *y*

source: quotient of *x* and *y*
uk: частка *x* і *y*

source: floored quotient of *x* and *y*
uk: поділ націло *x* і *y*

source: remainder of ``x / y``
uk: залишок від ділення ``x / y``

source: *x* negated
uk: *x* від'ємне

source: *x* unchanged
uk: *x* без змін

source: absolute value or magnitude of *x*
uk: абсолютне значення або величина *x*

source: *x* converted to integer
uk: *x* перетворене в ціле число

source: *x* converted to floating point
uk: *x* перетворене у число з плаваючою комою

source: a complex number with real part *re*, imaginary part *im*. *im* defaults to zero.
uk: комплексне число з дійсною частиною *re* та уявною частиною *im*. За замовчуванням *im* дорівнює нулю.

source: the pair ``(x // y, x % y)``
uk: об'єднує ``(x // y, x % y)``

source: *x* to the power *y*
uk: *x* у степені *y*

source: ``x // y`` also referred to as integer division. The resultant value is a whole integer, through the result's type is not necessarily int. The result is always rounded towards minus infinity: ``1 // 2`` is ``0``
uk: ``x // y`` також називається цілочисельним діленням. Значення результату є цілим числом, оскільки тип результату не обов'язково int. Результат завжди округлюється до мінус нескінченності: ``1 // 2`` є ``0``

source: ``float(x)`` also accepts the strings ``"nan"`` and ``"inf"`` with an optional prefix "+" or "-" for :abbr:`NaN(Not a Number)` and positive and negative infinity.
uk: ``float(x)`` також приймає рядки ``"nan"`` та ``"inf"`` з необов'язковим префіксом "+" або "-" для :abbr:`NaN(Not a Number)`` та додатної і від'ємної нескінченності.

source: Code examples
uk: Приклади коду

source: Integer numbers
uk: Цілі числа

source: Floating point numbers
uk: Числа з плаваючою комою

source: Value comparisons
uk: Порівняння значень

source: Numbers of built-in numeric types can be compared within and across their types (with the restriction that complex numbers do not support order comparison). Within the limits of the types involved, they compare mathematically correct without loss of precision.
uk: Числа вбудованих числових типів можна порівнювати всередині та між типами (з обмеженням, що комплексні числа не підтримують порівняння порядків). У межах відповідних типів вони порівнюються математично коректно без втрати точності.

source: The "not-a-number" values ``float("NaN")`` and ``decimal.Decimal('NaN')`` are special. Any ordered comparison of a number to a not-a-number value is false.
uk: Значення "не-число" ``float("NaN")`` та ``decimal.Decimal('NaN')`` є спеціальними. Будь-яке впорядковане порівняння числа зі значенням "не-число" є хибним.

source: Sequence types
uk: Типи послідовностей

source: There are 3 basic sequence types: *lists*, *tuples*, and *range objects*. Additional sequence types tailored for processing of binary data and text strings are described in dedicated sections.
uk: Існує 3 основних типи послідовностей: *списки*, *кортежі* та *об'єкти діапазону*. Додаткові типи послідовностей, призначені для обробки двійкових даних і текстових рядків, описано у відповідних розділах.

source: Lists
uk: Списки

source: Lists are mutable sequences, typically used to store collections of items. They may be constructed in several ways:
uk: Списки - це змінні послідовності, які зазвичай використовуються для зберігання колекцій елементів. Вони можуть бути побудовані кількома способами:

source: using a pair of square brackets to denote the empty list: ``[]``
uk: використовуючи пару квадратних дужок для позначення порожнього списку: ``[]``

source: using square brackets, separating items with commas: ``[a]``, ``[a, b, c]``
uk: використовуючи квадратні дужки, розділяючи елементи комами: ``[a]``, ``[a, b, c]``

source: using a list comprehension: ``[x for x in iterable]``
uk: використовуючи генератори списків: ``[x for x in iterable]``

source: using the type constructor: ``list()`` or ``list(iterable)``
uk: використовуючи конструктор типу: ``list()`` або ``list(iterable)``

source: Tuples
uk: Кортежі

source: Tuples are immutable sequences, typically used to store collections of data or for cases where an immutable sequence of data is needed (such as allowing storage in a ``set`` or ``dict`` instances). They may be constructed in a number of ways:
uk: Кортежі - це незмінні послідовності, які зазвичай використовуються для зберігання наборів даних або у випадках, коли потрібна незмінна послідовність даних (наприклад, для зберігання в екземплярах ``set`` або ``dict``). Вони можуть бути побудовані кількома способами:

source: using a pair of parentheses to denote the empty tuple: ``()``
uk: використовуючи пару круглих дужок для позначення порожнього кортежу: ``()``

source: using a trailing comma for a singleton tuple: ``a,`` or ``(a, b, c)``
uk: з використанням кінцевої коми для одиночного кортежу: ``a,`` або ``(a, b, c)``

source: separating items with commas: ``a, b, c`` or ``(a, b, c)``
uk: розділення елементів комами: ``a, b, c`` або ``(a, b, c)``

source: using the type constructor: ``tuple()`` or ``tuple(iterable)``
uk: з використанням конструктора типу: ``tuple()`` або ``tuple(iterable)``

source: Common operations
uk: Спільні операції

source: ``True`` if an item of *s* equal to *x* ``False`` if an item of *s* equal to *x*
uk: ``True``, якщо елемент *s* дорівнює *x* ``False``, якщо елемент *s* дорівнює *x*

source: the concatenation of *s* and *t*
uk: конкатенація *s* та *t*

source: equivalent to adding *s* to itself *n* times
uk: еквівалентно додаванню *s* до самого себе *n* разів

source: *i*-th item of *s*, origin 0
uk: *i*-й елемент з *s*, походження 0

source: slice of *s* from *i* to *j* with step *k*. any of these (or even all 3) may be omitted.
uk: фрагмент *s* від *i* до *j* з кроком *k*. будь-який з них (або навіть всі 3) можна опустити.

source: length of *s*
uk: довжина *s*

source: smallest item of *s*
uk: найменший елемент *s*

source: largest item of *s*
uk: найбільший елемент *s*

source: total number of occurrences of *x* in *s*
uk: загальна кількість входжень *x* у *s*

source: index of the first occurrence of *x* in *s* at or after index *i* and before index *j*
uk: індекс першого входження *x* у *s* на або після індексу *i* та перед індексом *j*

source: Sequences can be compared only within each of their types, with the restriction that ranges do not support order comparison. Equality comparison across these types results in inequality, and ordering comparison across these types raises ``TypeError``.
uk: Послідовності можна порівнювати лише в межах кожного типу, з обмеженням, що діапазони не підтримують порівняння за порядком. Порівняння рівності між цими типами призводить до нерівності, а порівняння порядку між цими типами викликає ``TypeError``.

source: Sequences compare lexicographically using comparison of corresponding elements. The built-in containers typically assume identical objects are equal to themselves. Lexicographical comparison between built-in collections works as follows:
uk: Послідовності порівнюються лексикографічно за допомогою порівняння відповідних елементів. Вбудовані контейнери зазвичай вважають ідентичні об'єкти рівними собі. Лексикографічне порівняння між вбудованими колекціями працює наступним чином:

source: For two collections to compare equal, they must be of the same type, have the same length, and each pair of corresponding elements must compare equal.
uk: Для того, щоб дві колекції були рівними, вони повинні бути одного типу, мати однакову довжину і кожна пара відповідних елементів повинна порівнюватися однаково.

source: Collections that supports order comparison are ordered the same as their first unequal elements. If corresponding element does not exist, the shorter collection is ordered first.
uk: Колекції, що підтримують порівняння порядків, впорядковуються так само, як і їх перші нерівні елементи. Якщо відповідного елемента не існує, то спочатку впорядковується коротша колекція.

source: Mutable sequence types
uk: Типи змінних послідовностей

source: item *i* of *s* is replaced by *x*
uk: елемент *i* в *s* замінюється на *x*

source: slice of *s* from *i* to *j* replaced by the contents of *t*
uk: фрагмент *s* від *i* до *j*, замінений вмістом *t*

source: same as ``s[i:j] = []``
uk: те саме, що ``s[i:j] = []``

source: the elements of *s* are replaced by those of *t* [#]_
uk: елементи *s* замінюються елементами *t* [#]_

source: removes the elements of ``s[i:j:k]`` from the list
uk: видаляє елементи ``s[i:j:k]`` зі списку

source: appends *x* to the end of the sequence; the same as ``s[len(s):len(s)] = [x]``
uk: додає *x* до кінця послідовності; те саме, що ``s[len(s):len(s)] = [x]``

source: removes all items from *s* (``del s[:]``) [#py33]_
uk: видаляє всі елементи з *s* (``del s[:]``) [#py33]_

source: creates a shallow copy of *s* (``s[:]``) [#py33]_
uk: створює поверхневу копію *s* (``s[:]``) [#py33]_

source: extends *s* with the contents of *t*
uk: розширює *s* вмістом *t*

source: inserts *x* into *s* at the index *i*; same as ``s[i:i] = [x]``
uk: вставляє *x* у *s* за індексом *i*; те саме, що ``s[i:i] = [x]``

source: retrieves the item at *i* and also removes it from *s* (if *i* is omitted - use the last one available index)
uk: отримує елемент за адресою *i*, а також видаляє його з *s* (якщо *i* пропущено - використовуйте останній доступний індекс)

source: remove the first item that is equal to *x* from *s*
uk: видалити перший елемент, який дорівнює *x*, із *s*

source: reverses the items of *s* in place
uk: перевертає елементи *s* на місце

source: *t* must have the same length as the slice it is replacing
uk: *t* повинен мати таку ж довжину, як і фрагмент, який він замінює

source: new in Python version 3.3
uk: нове в Python версії 3.3

source: Text sequence type
uk: Тип текстової послідовності

source: String methods
uk: Методи рядків

source: Strings implement all of the common sequence operations, along with the additional methods.
uk: Рядки реалізують всі звичайні операції з послідовністю, а також додаткові методи.

source: Strings compare lexicographically using the numerical Unicode code points of their characters.
uk: Рядки порівнюються лексикографічно, використовуючи числові кодові точки символів у Юнікоді.

source: Set types
uk: Типи множин

source: Sets (instances of ``set`` or ``frozenset``) can be compared within and across their types. They define order comparison operators to mean subset and superset tests. Those relations do not define total ordering (e.g. two sets ``{1, 2}`` and ``{2, 3}`` are not equal, nor subsets of one another, nor supersets of one another).
uk: Множини (екземпляри ``set`` або ``frozenset``) можна порівнювати всередині та між їхніми типами. Вони визначають оператори порівняння порядку, які означають тести підмножин та надмножин. Ці відношення не визначають повного впорядкування (наприклад, дві множини ``{1, 2}`` і ``{2, 3}`` не є рівними, не є підмножинами одна одної і не є надмножинами одна одної).

source: Mapping type
uk: Тип відображення

source: A mapping object maps hashable values to arbitrary objects. Mappings are mutable objects. There is currently ony one standard mapping type, the *dictionary*. In few words mappings are collections of keys and their values.
uk: Об'єкт зіставлення зіставляє хешовані значення з довільними об'єктами. Відображення є змінними об'єктами. Наразі існує лише один стандартний тип відображення, *dictionary*. Якщо кількома словами, то відображення - це набори ключів та їхніх значень.

source: A dictionary's keys are almost arbitrary values. Values that are not hashable may not be used as keys. Values that compare equal (such as ``1``, ``1.0`` and ``True``) can be used interchangeably to index the same dictionary entry.
uk: Ключі словника - це майже довільні значення. Значення, які не піддаються хешуванню, не можна використовувати як ключі. Значення, які порівнюються як рівні (наприклад, ``1``, ``1.0`` і ``True``), можуть використовуватися як взаємозамінні для індексації однієї і тієї ж словникової статті.

source: Dictionaries can be created by several means:
uk: Словники можна створювати кількома способами:

source: Use braces to denote the empty dictionary: ``{}``
uk: Використовуйте дужки для позначення порожнього словника: ``{}``

source: Use a comma-separated list of ``key: value`` pairs with braces: ``{'first_name': 'Serhii', 'last_name': 'Horodilov', 'age': 34}``
uk: Використовуйте список пар ``key: value`` через кому з дужками: ``{'first_name': 'Serhii', 'last_name': 'Horodilov', 'age': 34}``

source: Use a dict comprehension: ``{x: x ** 2 for x in range(10)}``
uk: Використовуючи генератори списків: ``{x: x 2 for x in range(10)}``

source: Use the type constructor: ``dict()``, ``dict([('key', 100)])``, ``dict(key=100)``
uk: Використовуйте конструктор типу: ``dict()``, ``dict([('key', 100)])``, ``dict(key=100)``

source: Instances of ``dict`` compare equal if and only if they have equal key-value pairs.
uk: Екземпляри ``dict`` порівнюються однаково тоді і тільки тоді, коли вони мають однакові пари ключ-значення.

source: Order comparisons raise ``TypeError``.
uk: Порівняння порядку викликає ``TypeError``.
